Revit 2027 API
Connector.VelocityPressure Property
 The velocity pressure of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VelocityPressure { get; }
Public ReadOnly Property VelocityPressure As Double
	Get
public:
property double VelocityPressure {
	double get ();
}
member VelocityPressure : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This connector does not support flow calculation and associated properties.
Remarks
 Instantaneous velocity pressure of this connector,calculated according to system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace